/** @file

Copyright (c) 2006 - 2011, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
 Cpu.uni

Abstract:
  cpu Form String Definitions.

Revision History:

**/



/=#
#langdef   en-US   "English"
#langdef   zh-Hans "\wide中文\narrow"

#string STR_CPU_FORM                        #language en-US   "CPU Configuration"
                                            #language zh-Hans "\narrowCPU \wide菜单\narrow"
#string STR_CPU_FORM_HELP                   #language en-US   "Contains CPU features."
                                            #language zh-Hans "\narrowCPU\wide相关的功能.\narrow"                                                                                        
#string STR_CPU_EPS_PROMPT                  #language en-US "Enhanced Power Saver"
                                            #language zh-Hans "\wide增强型节能\narrow"
#string STR_CPU_EPS_HELP                    #language en-US "Enable/Disable  Enhanced Power Saver"
                                            #language zh-Hans "\wide打开/关闭\narrowCPU\wide增强型节能\narrow"
#string STR_CPU_CORE_MP_PROMPT              #language en-US "CPU Core Count"
                                            #language zh-Hans "\wide使能Core的个数\narrow"
#string STR_CPU_CORE_MP_HELP                #language en-US "Set CPU Core Count"
                                            #language zh-Hans "\wide设定CPU使能的个数\narrow"
#string STR_CPU_VT_PROMPT                   #language en-US   "Virtualization Technology"
                                            #language zh-Hans "\narrowVirtualization\wide 技术\narrow"
#string STR_CPU_VT_HELP                     #language en-US   "Virtualization Technology allows PC platforms to run multiple applications and operating systems simultaneously in independent partitions, to help to manage and protect the multi-functional capabilities of PCs.Select whether to enable or disable Virtualization Technology."
                                            #language zh-Hans "\narrowVirtualization Technology\wide允许\narrowPC\wide平台可以同时在独立的分区同时运行多个应用程序和操作系统.它可以帮助管理和保护有多个功能能力的\narrowPCs\wide.选择是否打开或关闭\narrowVirtualization Technology."
#string STR_CPU_C1E_PROMPT                  #language en-US "C1E Support"
                                            #language zh-Hans "\narrowC1E \wide支持\narrow"
#string STR_CPU_C1E_HELP                    #language en-US "C1 is a state where the processor is not executing instructions, but can return to an executing state immediately. Select Enhanced C1 state (C1E) for lower power consumption when the computer is idle. Select whether to enable or disable Enhanced C1 State."
                                            #language zh-Hans "\narrowC1E\wide是增强型空闲电源管理状态。开启后,CPU在空闲轻负载状态可以降低工作电压与倍频达到省电的目的.选择是否要启用或禁用\narrowC1E."                                          
#string STR_CPU_CSTATE_PROMPT               #language en-US "CPU Processor C State"
                                            #language zh-Hans "\narrowC State \wide支持\narrow"
#string STR_CPU_CSTATE_HELP                 #language en-US "Main switch for enable CPU Processor C State state support"
                                            #language zh-Hans "\wide选择处理器电源状态.来减少系统空闲时处理的的功耗.\narrow"
#string STR_CPU_C2                          #language en-US "C2"
                                            #language zh-Hans "\narrowC2"
#string STR_CPU_C2_C3                       #language en-US "C2 C3"
                                            #language zh-Hans "\narrowC2 C3"
#string STR_CPU_C2_C3_UD                    #language en-US "C2 C3 Updown Mode"
                                            #language zh-Hans "\narrowC2 C3 Updown Mode"
#string STR_CPU_C2_C4                       #language en-US "C2 C4"
                                            #language zh-Hans "\narrowC2 C4"
#string STR_CPU_C2_C4_UD                    #language en-US "C2 C4 Updown Mode"
                                            #language zh-Hans "\narrowC2 C4 Updown Mode"
#string STR_CPUID_STRING                    #language en-US "CPU ID"
                                            #language zh-Hans "\narrowCPU ID"
#string STR_CPUID_VALUE                     #language en-US "N/A"
                                            #language zh-Hans "N/A"
#string STR_CPU_MICROCODE_REV_STRING        #language en-US "Microcode Revision (MM/DD/YYYY)"
                                            #language zh-Hans "\narrowMicrocode \wide版本信息 \narrow(MM/DD/YYYY)"
#string STR_CPU_MICROCODE_REV_VALUE         #language en-US "N/A"
                                            #language zh-Hans "N/A"                                            
                                            
#string STR_ALL                             #language en-US "All"
                                            #language zh-Hans "\narrowAll"
#string STR_SINGLE_CORE                     #language en-US "Single Core"
                                            #language zh-Hans "\narrowSingle Core"                                            
#string STR_DUAL_CORE                       #language en-US "Dual Core(if QP)"
                                            #language zh-Hans "\narrowDual Core(if QP)"
#string STR_TRI_CORE                        #language en-US "Tri Core(if QP)"
                                            #language zh-Hans "\narrowTri Core(if QP)" 

#string STR_PROCESSOR_VERSION_STRING                  #language en-US "CPU Type"
                                                      #language zh-Hans "\wideCPU类型\narrow"
#string STR_PROCESSOR_VERSION_VALUE                   #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_SPEED_STRING                    #language en-US "CPU Speed"
                                                      #language zh-Hans "\wideCPU频率\narrow"
#string STR_PROCESSOR_SPEED_VALUE                     #language en-US "N/A"
                                                      #language zh-Hans "N/A"
#string STR_PROCESSOR_SPEED_HELP                      #language en-US "Displays the Processor Speed."
                                                      #language zh-Hans "Displays the Processor Speed."
#string STR_PROCESSOR_CORE_COUNT_STRING               #language en-US "CPU Core Count"
                                                      #language zh-Hans "\wideCPU核心数量\narrow"
#string STR_PROCESSOR_CORE_COUNT_VALUE                #language en-US "N/A"

#string STR_PROCESSOR_CLUSTER_COUNT_STRING               #language en-US "CPU Cluster Count"
#string STR_PROCESSOR_CLUSTER_COUNT_VALUE                #language en-US "N/A"

#string STR_CACHE_L1I_SIZE_STRING               #language en-US "Cache L1i Size"
#string STR_CACHE_L1I_SIZE_VALUE                #language en-US "N/A"
#string STR_CACHE_L1D_SIZE_STRING               #language en-US "Cache L1d Size"
#string STR_CACHE_L1D_SIZE_VALUE                #language en-US "N/A"
#string STR_CACHE_L2_SIZE_STRING               #language en-US "Cache L2 Size"
#string STR_CACHE_L2_SIZE_VALUE                #language en-US "N/A"
  
#string STR_PMON_STATE         #language en-US "PMON State"
#string STR_SUPPORT         #language en-US "Support"
#string STR_VRM_INFO         #language en-US "VRM Info"
#string STR_VRM_VALUE         #language en-US "N/A"
#string STR_THREE         #language en-US "3"                                            
 #string STR_CPU_PMON                        #language en-US   "Enable PMON"
 #string STR_CPU_PMON_HELP                        #language en-US   "For SV team to verify Pmon function, they can disable Pmon to check does any issue is caused by Pmon funciont"
 #string STR_AUTO                        #language en-US   "Auto"
 #string STR_CPU_IOV_EN                        #language en-US   "Enable IOV Support"
 #string STR_CPU_IOV_EN_HELP                        #language en-US   "Than disable Pmon to check does any issue is caused by Pmon funciont"
 #string STR_CPU_EPS_EN                        #language en-US   "Enhanced Power Saver"
 #string STR_CPU_EPS_EN_HELP                        #language en-US   " "
 #string STR_CPU_IOV_EN_HELP                        #language en-US   "Tis option specifies whether IOV can be supported  by chipset"
 #string STR_CPU_SMRR_EN                        #language en-US   "SMRR"
 #string STR_CPU_SMRR_EN_HELP                        #language en-US   "Disable/Enable SMRR in WT or WB mode"
 #string STR_WT                        #language en-US   "WT"
 #string STR_WB                        #language en-US   "WB"
 #string STR_CPU_SMM_DMAPROT                        #language en-US   "SMM DMA Protection"
 #string STR_CPU_SMM_DMAPROT_HELP                        #language en-US   "SMM DMA Protection, it should related to SMRR option"

 #string STR_CPU_KILL_AP                        #language en-US   "Kill AP"
 #string STR_CPU_KILL_AP_HELP                        #language en-US   " "
 #string STR_1CORE_MAX                        #language en-US   "1 Core Max"
 #string STR_2CORES_MAX                        #language en-US   "2 Cores Max"
 #string STR_3CORES_MAX                        #language en-US   "3 Cores Max"
 #string STR_4CORES_MAX                        #language en-US   "4 Cores Max"
 #string STR_5CORES_MAX                        #language en-US   "5 Cores Max"
 #string STR_6CORES_MAX                        #language en-US   "6 Cores Max"
 #string STR_7CORES_MAX                        #language en-US   "7 Cores Max"

                                            
 #string STR_CPU_FIX_RATIO                        #language en-US   "Fix CPU ratio"
 #string STR_EMPTY                        #language en-US   " "
 #string STR_MAX                        #language en-US   "Max"
 #string STR_4X                        #language en-US  "4X"
 #string STR_5X                        #language en-US   "5X"
  #string STR_6X                        #language en-US  "6X"
 #string STR_7X                        #language en-US   "7X"
  #string STR_8X                        #language en-US  "8X"
  #string STR_CPU_EPS_EN                        #language en-US   "Enhanced Power Saver"                                          
 #string STR_CPU_CXE_EN                        #language en-US   "CPU Processor Enhance C State"
#string STR_ROUND_ROBIN_EN                        #language en-US   "Round Robin Mechanism Enable"
#string STR_ROUND_ROBIN_EN_HELP                        #language en-US   "When enable,if there are two cores which have the same priority, HIF will choose the two cores in turn"
#string STR_TPR_ECHO                        #language en-US   "TPR Echo"
#string STR_TPR_ECHO_HELP                        #language en-US   "When disable, CPU would not issue TPR echo cycle to chipset"
#string STR_CX_C4P_CTRL                        #language en-US   "Chipset Cx State Configuration"

#string STR_C2       #language en-US "C2"
#string STR_C2C3       #language en-US "C2 C3"
#string STR_C2C3_UPDOWN       #language en-US "C2 C3 Updown mode"
#string STR_C2C4       #language en-US "C2 C4"
#string STR_C2C4_UPDOWN       #language en-US "C2 C4 Updown mode"
#string STR_CONDITIONAL_C4       #language en-US "Conditional C4"
#string STR_CONDITIONAL_C4_HELP       #language en-US "Auto disable C4 if detect specific TV express cards."
#string STR_DISABLED       #language en-US "Disabled"
#string STR_AUTO       #language en-US "Auto"
#string STR_C5_CTRL       #language en-US "CPU Processor C5 Control"
#string STR_C5_CTRL_HELP       #language en-US "Dynamic enable C5 function. If Auto, the BIOS will check the processor whether supports C5; Otherwise, always disable C5 feature."
#string STR_ENABLED       #language en-US "Enabled"
#string STR_C5_DYNAMIC_L2SIZE       #language en-US "C5 Dynamic L2 sizing"
#string STR_C5_DYNAMIC_L2SIZE_HELP       #language en-US "Enable C5 Dynamic L2 sizing"
#string STR_CXINT_CTRL       #language en-US "Cx State Interrupt Filter"
#string STR_CXINT_CTRL_HELP       #language en-US "Enable Cx State interrupt filtering.  If enabled, only destination core wakes up. Else All Cores awake."
#string STR_C4P_CTRL       #language en-US "C4P Control"
#string STR_C4P_CTRL_HELP       #language en-US "Enable C4P Function"
#string STR_BACKC4P_TOC2       #language en-US "Back C4P to C2"
#string STR_BACKC4P_TOC2_HELP       #language en-US "Enable C4P state back to C2 Function"
#string STR_CPU_MSR3A                       #language en-US "VMX, MSR_Rx3A[2,0]"
#string STR_CPU_MSR3A_HELP                  #language en-US "For CPU VMX function debug"
#string STR_PARTIAL_RESET_EN                       #language en-US "Partial Reset"
#string STR_PARTIAL_RESET_EN_HELP                  #language en-US "For partial reset"

#string STR_TSC_DEADLINE_MODE                       #language en-US "TSC deadline mode"
#string STR_TSC_DEADLINE_MODE_HELP                  #language en-US "Enable or disable Local APIC Timer TSC deadline mode"
#string STR_EXECUTE_DISABLE                       #language en-US "Execute Disable(XD)"
